return function(mod)

    local function GI(i) return Isaac.GetItemIdByName(i)>0 and Isaac.GetItemIdByName(i) or Isaac.GetTrinketIdByName(i) end

	local Collectible = {
		[GI("Golden Idol")]={ru={"Золотой Идол","Проклятые богатства"},},
                [GI("Gun that can kill the Past")]={ru={"Пушка Убивающая Прошлое","Оставь прошлое позади"},},
                [GI('Birthday Cake')]={ru={"Именинный Торт","Счастливый Я!"},},
                [GI('Rusty Spoon')]={ru={"Ржавая Ложка","Тебе нравится их трогать..."},},
                [GI('Newgrounds Tank')]={ru={"Танк Newgrounds","Стань Танком!"},},
                [GI('Greed Butt')]={ru={"Алчная Жопа","Не трогай!"},},
                [GI('   Focus   ')]={ru={"Фокус","Забери их ДУШИ"},},
                [GI('  Focus  ')]={ru={"Фокус","Забери их ДУШИ"},},
                [GI(' Focus ')]={ru={"Фокус","Забери их ДУШИ"},},
                [GI('Focus')]={ru={"Фокус","Забери их ДУШИ"},},
                [GI('The Doorway')]={ru={"Проход","Открой ВСЕ двери"},},
                [GI('Strange Marble')]={ru={"Странный Марбл","Чудесные цвета..."},},
                [GI('Is You')]={ru={"Это Ты","ПРЕДМЕТ ЭТО ПРЕПЯТСТВИЕ"},},
                [GI('Nightmare Tick')]={ru={"Кошмарный Клещ","Эй, убери это!"},},
                [GI("Spelunker's Pack")]={ru={"Рюкзак Спелеолога","Искатель Сокровищ +12 бомб"},},
                [GI("Diogenes's Pot")]={ru={"Пифос Диогена","Уничтожь их, начни снова"},},
                [GI(" Diogenes's Pot ")]={ru={"Пифос Диогена","Уничтожь их, начни снова"},},
                [GI('George')]={ru={"Джордж","Зри в Корень"},},
                [GI('Possession')]={ru={"Одержимость","Следуй за Мной"},},
                [GI('Lollipop')]={ru={"Леденец","Не забудь поделиться!"},},
		[GI('Water Bottle')]={ru={"Бутылка Воды","Оставайся Свежим!"},},
                [GI(' Water Bottle ')]={ru={"Бутылка Воды","Скорострельность + Размер слезы повыш."},},
                [GI('  Water Bottle  ')]={ru={"Бутылка Воды","Наполовину Пустая..."},},
                [GI('   Water Bottle   ')]={ru={"Бутылка Воды","Ты разрываешь меня на части..."},},
                [GI('Aubrey')]={ru={"Обри","Больше Оружий"},},
                [GI('Tony')]={ru={"Тони","Повышение Урона, Без Оружия!"},},
                [GI('The Real Left Hand')]={ru={"Настоящая Левая Рука","Это надо понерфить..."},},	
                [GI('Hitops')]={ru={"Хайтопы","Запредельная Скорость"},},	
                [GI('Pop Pop')]={ru={"Пиф Паф","Спецатака по двойному нажатию"},},
                [GI('Football')]={ru={"Мяч для Регби","Дай пас!"},},
                [GI('Ball of Tumors')]={ru={"Метастазы","Собери их все!"},},
                [GI('Bow and Arrow')]={ru={"Лук и Стрелы","Немного в колчане..."},},		
                [GI('Emergency Meeting')]={ru={"Экстренное Совещание","Обратно на Базу!"},},
                [GI('Boxing Glove')]={ru={"Боксерская Перчатка","Риск Боли"},},	
                [GI('Gravity')]={ru={"Гравитация","Многоразовый Переворот"},},	
                [GI("Johnny's Knives")]={ru={"Ножи Джонни","Мне нужно, что бы ты истекал кровью..."},},	
                [GI('Ser Junkan')]={ru={"Сэр Хламовник","Самодельный Друг!"},},	
                [GI('The Crowdfunder')]={ru={"Спонсор","Накачай их Золотом!"},},
                [GI(' Gun that can kill the Past ')]={ru={"Пушка Убивающая Прошлое","Оставь прошлое позади"},},					
		[GI('  Gun that can kill the Past  ')]={ru={"Пушка Убивающая Прошлое","Оставь прошлое позади"},},	
		[GI('Polar Star')]={ru={"Полярная Звезда","Летай и Стреляй"},},
		[GI('Booster V2.0')]={ru={"Ускоритель V2.0","Летай и Стреляй"},},
		--[GI('')]={ru={"",""},},	
	}
	local Trinket={
        [GI("Ring of the Snake")]={ru={"Кольцо Змеи","Стартовая рука +2"},},	
        [GI('Hunky Boys')]={ru={"Горячие Парни","Они тебя не интересуют, но ты их..."},},
        [GI('Bible Thump')]={ru={"Библейский Удар!","Бог Беспощаден!"},},	
        [GI('Cheep Cheep')]={ru={"Цып-Цып","Ты Маленький Петушок!"},},	
	}
	local Cards={
        ['Cow on a Trash Farm']={ru={"Скотина Помойная","Верни свои деньги"},},
        ['Loot Card']={ru={"Карта Добычи","Просто уже используй ее!"},},
        ['Blank']={ru={"Пустышка","Без Пуль"},},
        ['Blanks']={ru={"Пустышки","Без Пуль"},},
        ['Jester']={ru={"Шут","Перетасуй Предметы"},},
        ['Witch']={ru={"Ведьма","Брось Кубик!"},},
        ['Murder!']={ru={"Убийство!","Убей всех, кого коснешься!"},},
        ['Chunk of Amber']={ru={"Кусочек Янтаря","Превосходно Сохранился!"},},
        ['Demon Form']={ru={"Облик Демона","Обрети Силу!"},},
        ['Fiend Fire']={ru={"Адское Пламя","Оно поглотило все..."},},
        --['']={ru={"",""},},
    }

	local ModTranslate = {
		['Collectibles'] = Collectible,
		['Trinkets'] = Trinket,
		['Cards'] = Cards,
		--['Pills'] = Pills,
	}
	ItemTranslate.AddModTranslation("warp zone", ModTranslate, {ru = true})

end
